<a href="https://colab.research.google.com/github/MateoProjects/UtilsAI/blob/main/pandas_utils.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas**

Primero hay que importar la libreria

In [ ]:
import pandas as pd

## Leyendo un CSV (coma separated value)

Podemos imprimir las primeras lineas de las tablas escribiendo df.head().

**Nota**: df es el nombre de nuestra variable donde la tabla está guardada.

In [ ]:
# Leer un archivo CSV
df = pd.read_csv('ruta/a/tu/archivo.csv')

# Mostrar las primeras filas del DataFrame
print(df.head())

# Especificando las columnas
df = pd.read_csv('ruta/a/tu/archivo.csv', usecols=['columna1', 'columna2'])
print(df.head())

Hay veces que nuestros csv no tendrán cabeceras donde nos indican el nombre de las columnas y que esto lo tendremos en otro archivo. Para leer el csv de forma correcta sin cabecera haremos lo siguiente:

In [ ]:
df = pd.read_csv('ruta/a/tu/archivo.csv', header=None)

Si quisieramos añadir las columnas hariamos lo siguiente:

In [ ]:
nombres_columnas = ['columna1', 'columna2', 'columna3']

# Leer CSV sin cabecera
df = pd.read_csv('ruta/a/tu/archivo.csv', header=None, names=nombres_columnas)

# Mostrar las primeras filas del DataFrame
print(df.head())

## Creando y manipulando un Dataframe

In [ ]:
d = {'col1': [1, 2], 'col2': [3, 4], 'col3': "Hola", 'col4': 0.45}
df = pd.DataFrame(data=d)

In [ ]:
df.head()

   col1  col2  col3  col4
0     1     3  Hola  0.45
1     2     4  Hola  0.45

## Tipos de columna

A veces nos puede interesar saber el tipo de variable que tenemos en cada columna para saber como debemos procesarla. Para ello tenemos la siguiente forma:

In [ ]:
df.dtypes

col1      int64
col2      int64
col3     object
col4    float64
dtype: object

### **Obtener los valores de una columna concreta**

A veces os puede interesar obtener los valores de una columna concreta. Para ello debéis usar ".iloc"

In [ ]:
df.iloc[:, 1]

0    3
1    4
Name: col2, dtype: int64

Si lo que queremos es for filas:

In [ ]:
df.loc[0]

col1       1
col2       3
col3    Hola
col4    0.45
Name: 0, dtype: object

### Drop duplicates

Hay veces que tendremos valores duplicados. Para ello los podemos eliminar de forma simple usando la función "drop_duplicates()"

In [ ]:
df.drop_duplicates()

### Count all nulls in dataframe

Podemos contar cuantos valores nulos tenemos en el código de la siguiente forma:

In [ ]:
df.isnull().sum().sum()

0

### Drops NA

**Representación**:

**null**: Es un término más genérico usado en programación para representar la ausencia de un valor. En Python y, por ende, en pandas, **null** se representa típicamente como None.
**NA**: Es una representación específica de pandas introducida en versiones recientes para manejar datos faltantes de una manera más consistente y flexible. Es parte del tipo de datos "**Nullable**" de pandas, como **pd.NA**.
Uso:

* **None**: Se utiliza comúnmente en estructuras de datos de Python como listas y diccionarios y es compatible con cualquier tipo de datos en pandas, pero su comportamiento puede variar según el tipo de datos de la columna donde se encuentra.

* **pd.NA**: Se utiliza específicamente en las series y dataframes de pandas. Proporciona un manejo uniforme de los datos faltantes, independientemente del tipo de datos de la columna (numérico, cadena, booleano, etc.)

In [ ]:
df.dropna()

   col1  col2  col3  col4
0     1     3  Hola  0.45
1     2     4  Hola  0.45

### Replace all NA/null data with value

In [ ]:
df.fillna(3)

   col1  col2  col3  col4
0     1     3  Hola  0.45
1     2     4  Hola  0.45